; domain
(define (domain health-care-1)
    (:requirements :strips :typing :negative-preconditions :existential-preconditions :universal-preconditions)

    (:types
        medical-unit box content robot patient - locatable
        robot-box robot-patient - robot
        location - object
    )

    (:predicates
        ; location predicates
        (at ?o - locatable ?l - location)
        (connected ?l1 - location ?l2 - location)
        ; box predicates
        (empty ?b - box)
        (box-free ?b - box)
        (box-has-content ?b - box ?c - content)
        ; content predicates
        (content-available ?c - content ?l - location)
        (unit-needs-content ?u - medical-unit ?c - content)
        (unit-has-content ?u - medical-unit ?c - content)
        ; patient predicates
        (patient-needs-unit ?p - patient ?u - medical-unit)
        (patient-at-unit ?p - patient ?u - medical-unit)
        ; robot-box predicates
        (robot-has-box ?r - robot-box ?b - box)
        (robot-can-carry ?r - robot-box)
        ; robot-patient predicates
        (robot-has-patient ?r - robot-patient ?p - patient)
        (robot-can-accompany ?r - robot-patient)
        (patient-free ?p - patient)
    )

    (:action pick-up-box
        :parameters (?r - robot-box ?b - box ?l - location)
        :precondition (and
            (at ?r ?l)
            (at ?b ?l)

            ; check that the robot is not already loaded with another box => here a robot can carry only one box at a time ; CHECK 
            (robot-can-carry ?r)

            ; check that the box is not already loaded with another robot ; CHECK 
            (box-free ?b)
        )
        :effect (and
            (robot-has-box ?r ?b)
            (not (robot-can-carry ?r))
            (not (box-free ?b))
        )
    )

    (:action pick-up-patient
        :parameters (?r - robot-patient ?p - patient ?l - location)
        :precondition (and
            (at ?r ?l)
            (at ?p ?l)

            ; check that the robot is not already loaded with another patient => here a robot can carry only one patient at a time ; CHECK
            (robot-can-accompany ?r)
            
            ; check that the patient is not already loaded with a robot ; CHECK
            (patient-free ?p)
        )
        :effect (and
            (robot-has-patient ?r ?p)
            (not (robot-can-accompany ?r))
            (not (patient-free ?p))
        )
    )
    

    (:action fill-box
        :parameters (?r - robot-box ?b - box ?c - content ?l - location)
        :precondition (and
            (empty ?b)
            (at ?r ?l)
            (at ?b ?l)
            (content-available ?c ?l)
            (robot-has-box ?r ?b)
        )
        :effect (and
            (not (empty ?b))
            (box-has-content ?b ?c)
            (not (content-available ?c ?l)) ; basically this means that the content is no longer available at the warehouse 
        )
    )

    (:action move-robot-without-box 
        :parameters (?r - robot-box ?from ?to - location)
        :precondition (and
            (at ?r ?from)
            (connected ?from ?to)
            (robot-can-carry ?r)
        )
        :effect (and
            (at ?r ?to)
            (not (at ?r ?from))
        )
    )
    
    (:action move-robot-with-box
        :parameters (?r - robot-box ?b - box ?from ?to - location)
        :precondition (and
            (at ?r ?from)
            (connected ?from ?to)
            (robot-has-box ?r ?b)
            (at ?b ?from)
        )
        :effect (and
            (at ?r ?to)
            (not (at ?r ?from))
            (at ?b ?to)
            (not (at ?b ?from))
        )
    )

    (:action move-robot-without-patient
        :parameters (?r - robot-patient ?from ?to - location)
        :precondition (and
            (at ?r ?from)
            (connected ?from ?to)
            (robot-can-accompany ?r)
        )
        :effect (and
            (at ?r ?to)
            (not (at ?r ?from))
        )
    )

    (:action move-robot-with-patient
        :parameters (?r - robot-patient ?p - patient ?from ?to - location)
        :precondition (and
            (at ?r ?from)
            (connected ?from ?to)
            (robot-has-patient ?r ?p)
            (at ?p ?from)
        )
        :effect (and
            (at ?r ?to)
            (not (at ?r ?from))
            (at ?p ?to)
            (not (at ?p ?from))
        )
    )

    
    (:action deliver-content
        :parameters (?r - robot-box ?b - box ?u - medical-unit ?c - content ?l - location)
        :precondition (and
            (at ?r ?l)
            (at ?u ?l)
            (robot-has-box ?r ?b)
            (box-has-content ?b ?c)   
            (unit-needs-content ?u ?c) ; the predicate "unit-needs-content" is an extra check to avoid delivering content to a unit that does not need it, so to avoid extra moves
        )
        :effect (and
            (unit-has-content ?u ?c)
            (not (unit-needs-content ?u ?c))
            (not (box-has-content ?b ?c))
            (not (robot-has-box ?r ?b)) ; robot is not carrying the box anymore : robot is free to carry another box or to reuse the same box
            ; box is empty and at the location (can be reused) : 
            (empty ?b)
            (at ?b ?l) 
            (robot-can-carry ?r)
            (box-free ?b)
        )
    )

    (:action deliver-patient
        :parameters (?r - robot-patient ?p - patient ?u - medical-unit ?l - location)
        :precondition (and
            (at ?r ?l)
            (at ?p ?l)
            (at ?u ?l)
            (patient-needs-unit ?p ?u)
            (robot-has-patient ?r ?p)
        )
        :effect (and
            (patient-at-unit ?p ?u)
            (not (patient-needs-unit ?p ?u))
            (not (robot-has-patient ?r ?p))
            (robot-can-accompany ?r)
            (patient-free ?p)
        )

    )
)

; problem
(define (problem p2-health-care-1)
    (:domain health-care-1)
    (:objects
        box1 box2 box3 - box
        robot-box1 - robot-box
        robot-patient1 - robot-patient
        
        central_warehouse entrance
        area1 area2 area3 emergency_area
        corridor1 corridor2
        - location
        
        MedicalUnit1 MedicalUnit2a MedicalUnit2b MedicalUnit3 EmergencyUnit - medical-unit
        scalpel aspirine tongue bandage antibiotic tank - content
        patient1 patient2 patient3 patient4 - patient
    )

    (:init
        ; all boxes are located at central_warehouse
        (at box1 central_warehouse)
        (at box2 central_warehouse)
        (at box3 central_warehouse)
        ; all contents are located at central_warehouse
        (content-available scalpel central_warehouse)
        (content-available aspirine central_warehouse)
        (content-available tongue central_warehouse)
        (content-available bandage central_warehouse)
        (content-available antibiotic central_warehouse)
        (content-available tank central_warehouse)
        ; medical units (not located at central_warehouse)
        (at MedicalUnit1 area1)
        (at MedicalUnit2a area2)
        (at MedicalUnit2b area2)
        (at MedicalUnit3 area3)
        (at EmergencyUnit emergency_area)
        ; single robot-box located at central_warehouse
        (at robot-box1 central_warehouse)
        ; single robot-patient located at entrance
        (at robot-patient1 entrance)
        

        (empty box1)
        (empty box2)
        (empty box3)
        (box-free box1)
        (box-free box2)
        (box-free box3)
        
        (at patient1 entrance)
        (at patient2 entrance)
        (at patient3 corridor1)
        (at patient4 corridor2)
        (patient-free patient1)
        (patient-free patient2)
        (patient-free patient3)
        (patient-free patient4)

        ; road map
        (connected central_warehouse corridor1)
        (connected corridor1 central_warehouse)
        (connected corridor1 area1)
        (connected area1 corridor1)
        (connected area1 area2)
        (connected area2 area1)
        (connected corridor1 area3)
        (connected area3 corridor1)
        (connected corridor2 corridor1)
        (connected corridor1 corridor2)
        (connected corridor2 emergency_area)
        (connected entrance corridor2)
        (connected corridor2 entrance)


        ; unit needs content
        (unit-needs-content MedicalUnit1 scalpel)
        (unit-needs-content MedicalUnit1 aspirine)
        (unit-needs-content MedicalUnit2a antibiotic)
        (unit-needs-content MedicalUnit2b tank)
        (unit-needs-content MedicalUnit3 tongue)
        (unit-needs-content EmergencyUnit bandage)
        
        ; patient needs accompaniment
        (patient-needs-unit patient1 MedicalUnit1)
        (patient-needs-unit patient2 MedicalUnit2b)
        (patient-needs-unit patient3 MedicalUnit3)
        (patient-needs-unit patient4 EmergencyUnit)

        ; robot can carry and accompany
        (robot-can-carry robot-box1)
        (robot-can-accompany robot-patient1)
    )

    (:goal
        (and
            (unit-has-content MedicalUnit1 scalpel)
            (unit-has-content MedicalUnit1 aspirine)
            (unit-has-content MedicalUnit2a antibiotic)
            (unit-has-content MedicalUnit2b tank)
            (unit-has-content MedicalUnit3 tongue)
            (unit-has-content EmergencyUnit bandage)
            
            (patient-at-unit patient1 MedicalUnit1)
            (patient-at-unit patient2 MedicalUnit2b)
            (patient-at-unit patient3 MedicalUnit3)
            (patient-at-unit patient4 EmergencyUnit)
        )
    )
)

; plan
1. (pick-up-patient robot-patient1 patient1 entrance)
   deleted: (robot-can-accompany robot-patient1) (patient-free patient1)
   added: (robot-has-patient robot-patient1 patient1)
   goals met: 0 of 10
2. (move-robot-with-patient robot-patient1 patient1 entrance corridor2)
   deleted: (at robot-patient1 entrance) (at patient1 entrance)
   added: (at robot-patient1 corridor2) (at patient1 corridor2)
   goals met: 0 of 10
3. (move-robot-with-patient robot-patient1 patient1 corridor2 corridor1)
   deleted: (at robot-patient1 corridor2) (at patient1 corridor2)
   added: (at robot-patient1 corridor1) (at patient1 corridor1)
   goals met: 0 of 10
4. (move-robot-with-patient robot-patient1 patient1 corridor1 area1)
   deleted: (at robot-patient1 corridor1) (at patient1 corridor1)
   added: (at robot-patient1 area1) (at patient1 area1)
   goals met: 0 of 10
5. (deliver-patient robot-patient1 patient1 medicalunit1 area1)
   deleted: (patient-needs-unit patient1 medicalunit1) (robot-has-patient robot-patient1 patient1)
   added: (patient-at-unit patient1 medicalunit1) (robot-can-accompany robot-patient1) (patient-free patient1)
   goals met: 1 of 10
6. (pick-up-box robot-box1 box1 central_warehouse)
   deleted: (robot-can-carry robot-box1) (box-free box1)
   added: (robot-has-box robot-box1 box1)
   goals met: 1 of 10
7. (fill-box robot-box1 box1 antibiotic central_warehouse)
   deleted: (empty box1) (content-available antibiotic central_warehouse)
   added: (box-has-content box1 antibiotic)
   goals met: 1 of 10
8. (move-robot-without-patient robot-patient1 area1 corridor1)
   deleted: (at robot-patient1 area1)
   added: (at robot-patient1 corridor1)
   goals met: 1 of 10
9. (pick-up-patient robot-patient1 patient3 corridor1)
   deleted: (robot-can-accompany robot-patient1) (patient-free patient3)
   added: (robot-has-patient robot-patient1 patient3)
   goals met: 1 of 10
10. (move-robot-with-patient robot-patient1 patient3 corridor1 area3)
   deleted: (at robot-patient1 corridor1) (at patient3 corridor1)
   added: (at robot-patient1 area3) (at patient3 area3)
   goals met: 1 of 10
11. (deliver-patient robot-patient1 patient3 medicalunit3 area3)
   deleted: (patient-needs-unit patient3 medicalunit3) (robot-has-patient robot-patient1 patient3)
   added: (patient-at-unit patient3 medicalunit3) (robot-can-accompany robot-patient1) (patient-free patient3)
   goals met: 2 of 10
12. (move-robot-without-patient robot-patient1 area3 corridor1)
   deleted: (at robot-patient1 area3)
   added: (at robot-patient1 corridor1)
   goals met: 2 of 10
13. (move-robot-without-patient robot-patient1 corridor1 corridor2)
   deleted: (at robot-patient1 corridor1)
   added: (at robot-patient1 corridor2)
   goals met: 2 of 10
14. (move-robot-without-patient robot-patient1 corridor2 entrance)
   deleted: (at robot-patient1 corridor2)
   added: (at robot-patient1 entrance)
   goals met: 2 of 10
15. (pick-up-patient robot-patient1 patient2 entrance)
   deleted: (robot-can-accompany robot-patient1) (patient-free patient2)
   added: (robot-has-patient robot-patient1 patient2)
   goals met: 2 of 10
16. (move-robot-with-patient robot-patient1 patient2 entrance corridor2)
   deleted: (at robot-patient1 entrance) (at patient2 entrance)
   added: (at robot-patient1 corridor2) (at patient2 corridor2)
   goals met: 2 of 10
17. (move-robot-with-patient robot-patient1 patient2 corridor2 corridor1)
   deleted: (at robot-patient1 corridor2) (at patient2 corridor2)
   added: (at robot-patient1 corridor1) (at patient2 corridor1)
   goals met: 2 of 10
18. (move-robot-with-patient robot-patient1 patient2 corridor1 area1)
   deleted: (at robot-patient1 corridor1) (at patient2 corridor1)
   added: (at robot-patient1 area1) (at patient2 area1)
   goals met: 2 of 10
19. (move-robot-with-patient robot-patient1 patient2 area1 area2)
   deleted: (at robot-patient1 area1) (at patient2 area1)
   added: (at robot-patient1 area2) (at patient2 area2)
   goals met: 2 of 10
20. (deliver-patient robot-patient1 patient2 medicalunit2b area2)
   deleted: (patient-needs-unit patient2 medicalunit2b) (robot-has-patient robot-patient1 patient2)
   added: (patient-at-unit patient2 medicalunit2b) (robot-can-accompany robot-patient1) (patient-free patient2)
   goals met: 3 of 10
21. (move-robot-without-patient robot-patient1 area2 area1)
   deleted: (at robot-patient1 area2)
   added: (at robot-patient1 area1)
   goals met: 3 of 10
22. (move-robot-without-patient robot-patient1 area1 corridor1)
   deleted: (at robot-patient1 area1)
   added: (at robot-patient1 corridor1)
   goals met: 3 of 10
23. (move-robot-without-patient robot-patient1 corridor1 corridor2)
   deleted: (at robot-patient1 corridor1)
   added: (at robot-patient1 corridor2)
   goals met: 3 of 10
24. (pick-up-patient robot-patient1 patient4 corridor2)
   deleted: (robot-can-accompany robot-patient1) (patient-free patient4)
   added: (robot-has-patient robot-patient1 patient4)
   goals met: 3 of 10
25. (move-robot-with-patient robot-patient1 patient4 corridor2 emergency_area)
   deleted: (at robot-patient1 corridor2) (at patient4 corridor2)
   added: (at robot-patient1 emergency_area) (at patient4 emergency_area)
   goals met: 3 of 10
26. (deliver-patient robot-patient1 patient4 emergencyunit emergency_area)
   deleted: (patient-needs-unit patient4 emergencyunit) (robot-has-patient robot-patient1 patient4)
   added: (patient-at-unit patient4 emergencyunit) (robot-can-accompany robot-patient1) (patient-free patient4)
   goals met: 4 of 10
27. (move-robot-with-box robot-box1 box1 central_warehouse corridor1)
   deleted: (at robot-box1 central_warehouse) (at box1 central_warehouse)
   added: (at robot-box1 corridor1) (at box1 corridor1)
   goals met: 4 of 10
28. (move-robot-with-box robot-box1 box1 corridor1 area1)
   deleted: (at robot-box1 corridor1) (at box1 corridor1)
   added: (at robot-box1 area1) (at box1 area1)
   goals met: 4 of 10
29. (move-robot-with-box robot-box1 box1 area1 area2)
   deleted: (at robot-box1 area1) (at box1 area1)
   added: (at robot-box1 area2) (at box1 area2)
   goals met: 4 of 10
30. (deliver-content robot-box1 box1 medicalunit2a antibiotic area2)
   deleted: (unit-needs-content medicalunit2a antibiotic) (box-has-content box1 antibiotic) (robot-has-box robot-box1 box1)
   added: (unit-has-content medicalunit2a antibiotic) (empty box1) (robot-can-carry robot-box1) (box-free box1)
   goals met: 5 of 10
31. (move-robot-without-box robot-box1 area2 area1)
   deleted: (at robot-box1 area2)
   added: (at robot-box1 area1)
   goals met: 5 of 10
32. (move-robot-without-box robot-box1 area1 corridor1)
   deleted: (at robot-box1 area1)
   added: (at robot-box1 corridor1)
   goals met: 5 of 10
33. (move-robot-without-box robot-box1 corridor1 central_warehouse)
   deleted: (at robot-box1 corridor1)
   added: (at robot-box1 central_warehouse)
   goals met: 5 of 10
34. (pick-up-box robot-box1 box2 central_warehouse)
   deleted: (robot-can-carry robot-box1) (box-free box2)
   added: (robot-has-box robot-box1 box2)
   goals met: 5 of 10
35. (fill-box robot-box1 box2 tank central_warehouse)
   deleted: (empty box2) (content-available tank central_warehouse)
   added: (box-has-content box2 tank)
   goals met: 5 of 10
36. (move-robot-with-box robot-box1 box2 central_warehouse corridor1)
   deleted: (at robot-box1 central_warehouse) (at box2 central_warehouse)
   added: (at robot-box1 corridor1) (at box2 corridor1)
   goals met: 5 of 10
37. (move-robot-with-box robot-box1 box2 corridor1 area1)
   deleted: (at robot-box1 corridor1) (at box2 corridor1)
   added: (at robot-box1 area1) (at box2 area1)
   goals met: 5 of 10
38. (move-robot-with-box robot-box1 box2 area1 area2)
   deleted: (at robot-box1 area1) (at box2 area1)
   added: (at robot-box1 area2) (at box2 area2)
   goals met: 5 of 10
39. (deliver-content robot-box1 box2 medicalunit2b tank area2)
   deleted: (unit-needs-content medicalunit2b tank) (box-has-content box2 tank) (robot-has-box robot-box1 box2)
   added: (unit-has-content medicalunit2b tank) (empty box2) (robot-can-carry robot-box1) (box-free box2)
   goals met: 6 of 10
40. (move-robot-without-box robot-box1 area2 area1)
   deleted: (at robot-box1 area2)
   added: (at robot-box1 area1)
   goals met: 6 of 10
41. (move-robot-without-box robot-box1 area1 corridor1)
   deleted: (at robot-box1 area1)
   added: (at robot-box1 corridor1)
   goals met: 6 of 10
42. (move-robot-without-box robot-box1 corridor1 central_warehouse)
   deleted: (at robot-box1 corridor1)
   added: (at robot-box1 central_warehouse)
   goals met: 6 of 10
43. (pick-up-box robot-box1 box3 central_warehouse)
   deleted: (robot-can-carry robot-box1) (box-free box3)
   added: (robot-has-box robot-box1 box3)
   goals met: 6 of 10
44. (fill-box robot-box1 box3 tongue central_warehouse)
   deleted: (empty box3) (content-available tongue central_warehouse)
   added: (box-has-content box3 tongue)
   goals met: 6 of 10
45. (move-robot-with-box robot-box1 box3 central_warehouse corridor1)
   deleted: (at robot-box1 central_warehouse) (at box3 central_warehouse)
   added: (at robot-box1 corridor1) (at box3 corridor1)
   goals met: 6 of 10
46. (move-robot-with-box robot-box1 box3 corridor1 area3)
   deleted: (at robot-box1 corridor1) (at box3 corridor1)
   added: (at robot-box1 area3) (at box3 area3)
   goals met: 6 of 10
47. (deliver-content robot-box1 box3 medicalunit3 tongue area3)
   deleted: (unit-needs-content medicalunit3 tongue) (box-has-content box3 tongue) (robot-has-box robot-box1 box3)
   added: (unit-has-content medicalunit3 tongue) (empty box3) (robot-can-carry robot-box1) (box-free box3)
   goals met: 7 of 10
48. (pick-up-box robot-box1 box3 area3)
   deleted: (robot-can-carry robot-box1) (box-free box3)
   added: (robot-has-box robot-box1 box3)
   goals met: 7 of 10
49. (move-robot-with-box robot-box1 box3 area3 corridor1)
   deleted: (at robot-box1 area3) (at box3 area3)
   added: (at robot-box1 corridor1) (at box3 corridor1)
   goals met: 7 of 10
50. (move-robot-with-box robot-box1 box3 corridor1 central_warehouse)
   deleted: (at robot-box1 corridor1) (at box3 corridor1)
   added: (at robot-box1 central_warehouse) (at box3 central_warehouse)
   goals met: 7 of 10
51. (fill-box robot-box1 box3 aspirine central_warehouse)
   deleted: (empty box3) (content-available aspirine central_warehouse)
   added: (box-has-content box3 aspirine)
   goals met: 7 of 10
52. (move-robot-with-box robot-box1 box3 central_warehouse corridor1)
   deleted: (at robot-box1 central_warehouse) (at box3 central_warehouse)
   added: (at robot-box1 corridor1) (at box3 corridor1)
   goals met: 7 of 10
53. (move-robot-with-box robot-box1 box3 corridor1 area1)
   deleted: (at robot-box1 corridor1) (at box3 corridor1)
   added: (at robot-box1 area1) (at box3 area1)
   goals met: 7 of 10
54. (deliver-content robot-box1 box3 medicalunit1 aspirine area1)
   deleted: (unit-needs-content medicalunit1 aspirine) (box-has-content box3 aspirine) (robot-has-box robot-box1 box3)
   added: (unit-has-content medicalunit1 aspirine) (empty box3) (robot-can-carry robot-box1) (box-free box3)
   goals met: 8 of 10
55. (pick-up-box robot-box1 box3 area1)
   deleted: (robot-can-carry robot-box1) (box-free box3)
   added: (robot-has-box robot-box1 box3)
   goals met: 8 of 10
56. (move-robot-with-box robot-box1 box3 area1 corridor1)
   deleted: (at robot-box1 area1) (at box3 area1)
   added: (at robot-box1 corridor1) (at box3 corridor1)
   goals met: 8 of 10
57. (move-robot-with-box robot-box1 box3 corridor1 central_warehouse)
   deleted: (at robot-box1 corridor1) (at box3 corridor1)
   added: (at robot-box1 central_warehouse) (at box3 central_warehouse)
   goals met: 8 of 10
58. (fill-box robot-box1 box3 scalpel central_warehouse)
   deleted: (empty box3) (content-available scalpel central_warehouse)
   added: (box-has-content box3 scalpel)
   goals met: 8 of 10
59. (move-robot-with-box robot-box1 box3 central_warehouse corridor1)
   deleted: (at robot-box1 central_warehouse) (at box3 central_warehouse)
   added: (at robot-box1 corridor1) (at box3 corridor1)
   goals met: 8 of 10
60. (move-robot-with-box robot-box1 box3 corridor1 area1)
   deleted: (at robot-box1 corridor1) (at box3 corridor1)
   added: (at robot-box1 area1) (at box3 area1)
   goals met: 8 of 10
61. (deliver-content robot-box1 box3 medicalunit1 scalpel area1)
   deleted: (unit-needs-content medicalunit1 scalpel) (box-has-content box3 scalpel) (robot-has-box robot-box1 box3)
   added: (unit-has-content medicalunit1 scalpel) (empty box3) (robot-can-carry robot-box1) (box-free box3)
   goals met: 9 of 10
62. (pick-up-box robot-box1 box3 area1)
   deleted: (robot-can-carry robot-box1) (box-free box3)
   added: (robot-has-box robot-box1 box3)
   goals met: 9 of 10
63. (move-robot-with-box robot-box1 box3 area1 corridor1)
   deleted: (at robot-box1 area1) (at box3 area1)
   added: (at robot-box1 corridor1) (at box3 corridor1)
   goals met: 9 of 10
64. (move-robot-with-box robot-box1 box3 corridor1 central_warehouse)
   deleted: (at robot-box1 corridor1) (at box3 corridor1)
   added: (at robot-box1 central_warehouse) (at box3 central_warehouse)
   goals met: 9 of 10
65. (fill-box robot-box1 box3 bandage central_warehouse)
   deleted: (empty box3) (content-available bandage central_warehouse)
   added: (box-has-content box3 bandage)
   goals met: 9 of 10
66. (move-robot-with-box robot-box1 box3 central_warehouse corridor1)
   deleted: (at robot-box1 central_warehouse) (at box3 central_warehouse)
   added: (at robot-box1 corridor1) (at box3 corridor1)
   goals met: 9 of 10
67. (move-robot-with-box robot-box1 box3 corridor1 corridor2)
   deleted: (at robot-box1 corridor1) (at box3 corridor1)
   added: (at robot-box1 corridor2) (at box3 corridor2)
   goals met: 9 of 10
68. (move-robot-with-box robot-box1 box3 corridor2 emergency_area)
   deleted: (at robot-box1 corridor2) (at box3 corridor2)
   added: (at robot-box1 emergency_area) (at box3 emergency_area)
   goals met: 9 of 10
69. (deliver-content robot-box1 box3 emergencyunit bandage emergency_area)
   deleted: (unit-needs-content emergencyunit bandage) (box-has-content box3 bandage) (robot-has-box robot-box1 box3)
   added: (unit-has-content emergencyunit bandage) (empty box3) (robot-can-carry robot-box1) (box-free box3)
   goals met: 10 of 10
